---
type: GraphicsStyle
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# GraphicsStyle

`Autodesk.Revit.DB.GraphicsStyle` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | GraphicsStyleCategory | — | `public Category GraphicsStyleCategory { get ; }` |
| Property | GraphicsStyleType | — | `public GraphicsStyleType GraphicsStyleType { get ; }` |
| Property | Parameter | — | `` |